org/20220802094127-random_variables_in_aesara.org
:PROPERTIES:
:ID:       2e41e200-be7a-482b-8cfe-d0d67df26920
:END:
#+title: Random Variables in Aesara

- =RandomGenerator=
- =RandomState=
- =RandomStream=

* AeP (Aesara Enhancement Propoal)
** Guidelines

A good PRNG design satisfies the following conditions:
1. It is **expressive**: the behavior of the system is **predictable** by the caller, and allows them to expression any probabilistic program;
2. It makes it possible to build **reproducible** programs ("seeding");
3. It is **explicit in Aesara's IR**
4. It can be manipulated by **Aesara's rewrite system**;
5. It can be *easily transpiled* to current backends;
6. It enables **vectorization** with generalized universal functions;

** Limits of the current design

The current =RandomState= model threads the RNG state through all the functions that generate random values. This is how the =RandomState= API would look like with =default_output= set to =None=:

#+begin_src python
import aesara.tensor as at
import numpy as np

def sample(rng):

rng = np.random.default_rng(12)
rng_x, x_rv = at.random.normal(0, 1, rng=rng)
rng_y, y_rv = at.random.normal(0, 1, rng=rng_x)
z_at = x_rv + y_rv
#+end_src

This design is inconvenient to work with.

**** Error-prone and cumbersome

*For users* having to explictly thread the =rng= states is both error-prone and cumbersome. I believe this is why the RNG output is hidden by setting =default_output= to =1=, and one of the motivations behind the =RandomStream= interface.

**** Adds sequencing constraints between functions that have no data dependence

*For the Aesara IR* the threading of RNGs adds sequencing constraints between functions that have no data dependence otherwise. In theory, the two calls to =at.random.normal= are independent and could be made in parallel. In practice, one has to wait for the first call to complete to be able to make the second all.

Same with gufuncs: we do not want to introduce rng-dependence between the different function calls. We want to be able to give each dimension (give example) a rng and let it run with it. No collision:

**** Lack of a clear symbolic representation

*For the Aesara IR* we don't have distinct operators that updates the random state and generate a pseudo-random number from a random state.

And finally this is not enought for the one-to-many problem in rewrites.

Only the caller knows how the random state should be managed as called functions are unaware of the context. The solution is very simple, it is to give the caller the responsibility of advancing the rng state. So functions do not need to return RNG state.

/Note:/ Well, some function have to return the RNG state in JAX and it's the body function of while loops. Still goes to show how broken of an abstraction it is. There needs to pass RNG state because there /is/ a data dependence between the two.

#+begin_src python
def sequential(rng):
    rng_y, rng_z = at.random.split(rng, 2)
    return call(rng_y) + call(rng_z)

sequential_et = etuple(
    etuplize(at.add),
    etuple(
        call,
        etuple(
            nth,
            0,
            etuple(
                etuplize(at.random.split),
                rng,
                2
            )
        )
    ),
    etuple(
        call,
        etuple(
            nth,
            1,
            etuple(
                etuplize(at.random.split),
                rng,
                2
            )
        )
    )
)
#+end_src

*First* justify the =split=, =rand= symbolic interface (reference Haskell)


Counter based approach: [[http://www.thesalmons.org/john/random123/papers/random123sc11.pdf][Parallel Random Numbers: As easy as 1, 2, 3]]

** Proposal: A Haskell-like design

In the following we will first focus on /the symbolic representation of RNGs in Aesara's IR/. We leave discussions about compilation of this representation for the end.

To begin with we need to distinguish between two objects that are conflated in Aesara:
- The =RandomState= which is the current state of the random number generator;
- The =RandomVariable=, which takes a =RandomState= and returns a pseudo-random number =Bit=

If we represent the internal state of the PRNG by the type =RandState=, the current design of =RandomVariable=\s can be summarized by the following simplified signature:

#+begin_src haskell
RandomVariable :: RandState -> (RandState, TensorVariable)
#+end_src

In other words, =RandomVariable=\s are responsible for advancing the state of the PRNG, and produce a random value. This double responsibility is what creates graph dependencies between nodes that have otherwise no dependency i.e. that wouldn't be linked had they not needed the PRNG. We can see that on the following listing:

#+begin_src python :session :results output
import aesara
import aesara.tensor as at

rng = at.random.type.RandomStateType()('rng')

rng_x, x_rv = at.random.normal(0, 1, rng=rng, name='x').owner.outputs
rng_y, y_rv = at.random.normal(0, 1, rng=rng_x, name='y').owner.outputs
z_rv = at.random.normal(0, 1, rng=rng_y, name='z')
w_at = x_rv + y_rv + z_rv

aesara.dprint(w_at)
#+end_src

#+RESULTS:
#+begin_example
Elemwise{add,no_inplace} [id A]
 |Elemwise{add,no_inplace} [id B]
 | |normal_rv{0, (0, 0), floatX, False}.1 [id C] 'x'
 | | |rng [id D]
 | | |TensorConstant{[]} [id E]
 | | |TensorConstant{11} [id F]
 | | |TensorConstant{0} [id G]
 | | |TensorConstant{1} [id H]
 | |normal_rv{0, (0, 0), floatX, False}.1 [id I] 'y'
 |   |normal_rv{0, (0, 0), floatX, False}.0 [id C]
 |   |TensorConstant{[]} [id J]
 |   |TensorConstant{11} [id K]
 |   |TensorConstant{0} [id L]
 |   |TensorConstant{1} [id M]
 |normal_rv{0, (0, 0), floatX, False}.1 [id N] 'z'
   |normal_rv{0, (0, 0), floatX, False}.0 [id I]
   |TensorConstant{[]} [id O]
   |TensorConstant{11} [id P]
   |TensorConstant{0} [id Q]
   |TensorConstant{1} [id R]
#+end_example

