20220802094127-random_variables_in_aesara.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-11 Tue 11:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Random Variables in Aesara</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Random Variables in Aesara</h1>
<ul class="org-ul">
<li><code>RandomGenerator</code></li>
<li><code>RandomState</code></li>
<li><code>RandomStream</code></li>
</ul>

<div id="outline-container-org74a3efd" class="outline-2">
<h2 id="org74a3efd">AeP (Aesara Enhancement Propoal)</h2>
<div class="outline-text-2" id="text-org74a3efd">
</div>
<div id="outline-container-org6138448" class="outline-3">
<h3 id="org6138448">Guidelines</h3>
<div class="outline-text-3" id="text-org6138448">
<p>
A good PRNG design satisfies the following conditions:
</p>
<ol class="org-ol">
<li>It is <b><b>expressive</b></b>: the behavior of the system is <b><b>predictable</b></b> by the caller, and allows them to expression any probabilistic program;</li>
<li>It makes it possible to build <b><b>reproducible</b></b> programs ("seeding");</li>
<li>It is <b><b>explicit in Aesara's IR</b></b></li>
<li>It can be manipulated by <b><b>Aesara's rewrite system</b></b>;</li>
<li>It can be <b>easily transpiled</b> to current backends;</li>
<li>It enables <b><b>vectorization</b></b> with generalized universal functions;</li>
</ol>
</div>
</div>

<div id="outline-container-orgcf644af" class="outline-3">
<h3 id="orgcf644af">Limits of the current design</h3>
<div class="outline-text-3" id="text-orgcf644af">
<p>
The current <code>RandomState</code> model threads the RNG state through all the functions that generate random values. This is how the <code>RandomState</code> API would look like with <code>default_output</code> set to <code>None</code>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sample</span>(rng):

<span style="font-weight: bold; font-style: italic;">rng</span> = np.random.default_rng(12)
<span style="font-weight: bold; font-style: italic;">rng_x</span>, <span style="font-weight: bold; font-style: italic;">x_rv</span> = at.random.normal(0, 1, rng=rng)
<span style="font-weight: bold; font-style: italic;">rng_y</span>, <span style="font-weight: bold; font-style: italic;">y_rv</span> = at.random.normal(0, 1, rng=rng_x)
<span style="font-weight: bold; font-style: italic;">z_at</span> = x_rv + y_rv
</pre>
</div>

<p>
This design is inconvenient to work with.
</p>
</div>

<ul class="org-ul">
<li><a id="org81a9f87"></a>Error-prone and cumbersome<br />
<div class="outline-text-5" id="text-org81a9f87">
<p>
<b>For users</b> having to explictly thread the <code>rng</code> states is both error-prone and cumbersome. I believe this is why the RNG output is hidden by setting <code>default_output</code> to <code>1</code>, and one of the motivations behind the <code>RandomStream</code> interface.
</p>
</div>
</li>

<li><a id="org2e4d0c9"></a>Adds sequencing constraints between functions that have no data dependence<br />
<div class="outline-text-5" id="text-org2e4d0c9">
<p>
<b>For the Aesara IR</b> the threading of RNGs adds sequencing constraints between functions that have no data dependence otherwise. In theory, the two calls to <code>at.random.normal</code> are independent and could be made in parallel. In practice, one has to wait for the first call to complete to be able to make the second all.
</p>

<p>
Same with gufuncs: we do not want to introduce rng-dependence between the different function calls. We want to be able to give each dimension (give example) a rng and let it run with it. No collision:
</p>
</div>
</li>

<li><a id="org3d48b26"></a>Lack of a clear symbolic representation<br />
<div class="outline-text-5" id="text-org3d48b26">
<p>
<b>For the Aesara IR</b> we don't have distinct operators that updates the random state and generate a pseudo-random number from a random state.
</p>

<p>
And finally this is not enought for the one-to-many problem in rewrites.
</p>

<p>
Only the caller knows how the random state should be managed as called functions are unaware of the context. The solution is very simple, it is to give the caller the responsibility of advancing the rng state. So functions do not need to return RNG state.
</p>

<p>
<i>Note:</i> Well, some function have to return the RNG state in JAX and it's the body function of while loops. Still goes to show how broken of an abstraction it is. There needs to pass RNG state because there <i>is</i> a data dependence between the two.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sequential</span>(rng):
    <span style="font-weight: bold; font-style: italic;">rng_y</span>, <span style="font-weight: bold; font-style: italic;">rng_z</span> = at.random.split(rng, 2)
    <span style="font-weight: bold;">return</span> call(rng_y) + call(rng_z)

<span style="font-weight: bold; font-style: italic;">sequential_et</span> = etuple(
    etuplize(at.add),
    etuple(
        call,
        etuple(
            nth,
            0,
            etuple(
                etuplize(at.random.split),
                rng,
                2
            )
        )
    ),
    etuple(
        call,
        etuple(
            nth,
            1,
            etuple(
                etuplize(at.random.split),
                rng,
                2
            )
        )
    )
)
</pre>
</div>

<p>
<b>First</b> justify the <code>split</code>, <code>rand</code> symbolic interface (reference Haskell)
</p>


<p>
Counter based approach: <a target='_blank' rel='noopener noreferrer' class='external' href="http://www.thesalmons.org/john/random123/papers/random123sc11.pdf">Parallel Random Numbers: As easy as 1, 2, 3</a>
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org981a13b" class="outline-3">
<h3 id="org981a13b">Proposal: A Haskell-like design</h3>
<div class="outline-text-3" id="text-org981a13b">
<p>
In the following we will first focus on <i>the symbolic representation of RNGs in Aesara's IR</i>. We leave discussions about compilation of this representation for the end.
</p>

<p>
To begin with we need to distinguish between two objects that are conflated in Aesara:
</p>
<ul class="org-ul">
<li>The <code>RandomState</code> which is the current state of the random number generator;</li>
<li>The <code>RandomVariable</code>, which takes a <code>RandomState</code> and returns a pseudo-random number <code>Bit</code></li>
</ul>

<p>
If we represent the internal state of the PRNG by the type <code>RandState</code>, the current design of <code>RandomVariable</code>\s can be summarized by the following simplified signature:
</p>

<div class="org-src-container">
<pre class="src src-haskell">RandomVariable :: RandState -&gt; (RandState, TensorVariable)
</pre>
</div>

<p>
In other words, <code>RandomVariable</code>\s are responsible for advancing the state of the PRNG, and produce a random value. This double responsibility is what creates graph dependencies between nodes that have otherwise no dependency i.e. that wouldn't be linked had they not needed the PRNG. We can see that on the following listing:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara
<span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">rng</span> = at.random.<span style="font-weight: bold;">type</span>.RandomStateType()(<span style="font-style: italic;">'rng'</span>)

<span style="font-weight: bold; font-style: italic;">rng_x</span>, <span style="font-weight: bold; font-style: italic;">x_rv</span> = at.random.normal(0, 1, rng=rng, name=<span style="font-style: italic;">'x'</span>).owner.outputs
<span style="font-weight: bold; font-style: italic;">rng_y</span>, <span style="font-weight: bold; font-style: italic;">y_rv</span> = at.random.normal(0, 1, rng=rng_x, name=<span style="font-style: italic;">'y'</span>).owner.outputs
<span style="font-weight: bold; font-style: italic;">z_rv</span> = at.random.normal(0, 1, rng=rng_y, name=<span style="font-style: italic;">'z'</span>)
<span style="font-weight: bold; font-style: italic;">w_at</span> = x_rv + y_rv + z_rv

aesara.dprint(w_at)
</pre>
</div>
</div>
