org/20220802094127-random_variables_in_aesara.org
*** New operators

A natural idea is to simplify the design of =RandomVariable=\s so that it is only responsible for one thing: create a random value from a PRNG state. The =Op= thus creates an =Apply= node that takes a =RandomState= as input and outputs a (random) =Variable=:

#+begin_src haskell
RandomVariable :: RandomState -> Variable
#+end_src

We can now make the =RandState= output explicit (1) by making =rng= an explicit input of the =RandomVariable='s =__call__= method. And we can verify in the following that the sequential dependency between =x_rv= and =y_rv= disappears:

#+begin_src python
import aesara.tensor as at

# rng_x and rng_y are created before that.
x_rv = at.random.normal(rng_x, 0, 1)
y_rv = at.random.normal(rng_y, 0, 1)
#+end_src

This interface presupposes the existence of an operator that creates an updated =RandomState= from a =RandomState=:

#+begin_src haskell
next :: RandomState -> RandomState
#+end_src

To be able to build reproducible programs (2), we also need an operator that creates a =RandomState= from a seed:

#+begin_src haskell
default_rng :: Seed -> RandomState
#+end_src

We can thus fill in the blanks in the previous code snippet:

#+begin_src python
import aesara.tensor as at

rng = at.random.default_rng(0)

rng_x = at.random.next(rng)
x_rv = at.random.normal(rng_x, 0, 1)

rng_y = at.random.next(rng_x)
y_rv = at.random.normal(rng_y, 0, 1)

z_at = x_rv + y_rv
#+end_src

#+begin_src python :session
import aesara.tensor as at
import numpy as np

rng = at.random.type.RandomGeneratorType()("rng")

rng_x, x_rv = at.random.normal(0,1, rng=rng).owner.outputs
rng_y, y_rv = at.random.normal(0,1, rng=rng_x).owner.outputs

def next(rng):
    bit_generator = rng.bit_generator.advance(1)
    return np.random.Generator(bit_generator)

#+end_src

#+RESULTS:

This code generates Aesara graphs that are very similar to the ones generated by =RandomStream=:

#+begin_src python :session
import aesara.tensor as at

srng = at.random.RandomStream()

x_rv = srng.normal(0, 1)
y_rv = srng.normal(0, 1)
z_at = x_rv + y_rv
#+end_src

#+RESULTS:

Roughly speaking, =RandomStream= moves this "next" mechanism to the /updates/ graph, while this symbolic representation of the state of the PRNG makes it explicit in the same graph. The graph between =RandomState=\s in the proposed scheme is a concretization of the updates graph for the =RandomStream=.

#+begin_src python :results output :session
import aesara
import aesara.tensor as at

srng = at.random.RandomStream(seed=123)
x_rv = srng.normal()
y_rv = srng.normal()
z_at = x_rv + y_rv

aesara.dprint(y_rv.owner.inputs[0].default_update)
#+end_src

#+RESULTS:
: normal_rv{0, (0, 0), floatX, False}.0 [id A]
:  |RandomGeneratorSharedVariable(<Generator(PCG64) at 0x7FE7411BCF20>) [id B]
:  |TensorConstant{[]} [id C]
:  |TensorConstant{11} [id D]
:  |TensorConstant{0.0} [id E]
:  |TensorConstant{1.0} [id F]

Let us now consider a more complex situation, when =call_x= and =call_y= are two functions that require a =RandomState=:

#+begin_src python
import aesara.tensor as at

rng = at.random.default_rng(0)

rng_x = at.random.next(rng)
x_rv = call_x(rng_x)

rng_y = at.random.next(rng_x)
y_rv = call_y(rng_y)

z_at = x_rv + y_rv
#+end_src

We can easily make the previous code generate a collision:

#+begin_src python
def call_x(rng_a):
    a_rv = at.random.normal(rng_a, 0, 1)
    rng_b = at.random.next(rng_a)
    b_rv = at.random.normal(rng_b, 0, 1)
    return a_rv * b_rv
#+end_src

The issue arises because our symbolic structure is /linear/: each =RandState= has one and only one ancestor. What we need instead is to allow =RandState=\s to have several ancestors; We thus define the =at.random.op.Split= operator:

#+begin_src haskell
split :: RandState -> (RandState, RandState)
#+end_src

This can be easily implemented: if =RandState= is a binary number <..> then the leftmost key is obtained by appending =0=, the rightmost =1=. Any succession of splitting operations builds a binary tree. If =Rand= is a deterministic function of this value, then the computations are fully reproducible. This binary tree structure is encoded directly in the graph IR:

#+begin_src python
import aesara.tensor as at

rng = at.random.default_rng(0)
rng_x, rng_y = at.random.split(rng)

etuplize(rng_x)
# etuple(nth, 0, etuple(at.random.split, etuple(at.random.default_rng, 0)))

etuplize(rng_y)
# etuple(nth, 1, etuple(at.random.split, etuple(at.random.default_rng, 0)))
#+end_src

Although it may be possible to keep =Next= within this representation, its interaction with the =Split= operator requires careful thought. We forget it for now, as =Split= is expressive enough. The original program becomes:

#+begin_src python
import aesara.tensor as at

rng = at.random.default_rng()
rng_x, rng_y = at.random.split(rng)

x_rv = at.random.normal(rng_x, 0, 1)
y_rv = at.random.normal(rng_y, 0, 1)
z_at = x_rv + y_rv
#+end_src

It is also natural to implement the =at.random.op.SplitN= operator represented by:

#+begin_src haskell
splitn :: RandState -> Int -> (RandState, ..., RandState)
#+end_src

So we can write the following code:

#+begin_src python
at.random.split = at.random.Split()

rng = at.random.default_rng()
rng_v, rng_w, rng_x, rng_y = at.random.splitn(rng, 4)

v_rv = at.random.normal(rng_y, 0, 1)
w_rv = at.random.normal(rng_x, 0, 1)
x_rv = at.random.normal(rng_x, 0, 1)
y_rv = at.random.normal(rng_y, 0, 1)
z_at = v_rv + w_rv + x_rv + z_rv
#+end_src

This will prove useful e.g. for use with generalized universal functions.

A nice consequence of this "splitting" design is that the graph that updates the =RandomState=\s is always neatly separated from the "main" graph that contains the =RandomVariable=\s. Does this help with rewrites?



Counter-based RNGs are now ubiquitous, in NumPy, JAX, XLA, PyTorch, etc so we can mostly rely on their design for =RandomState=

