20220802094127-random_variables_in_aesara.html

<div id="outline-container-org66a2bf1" class="outline-4">
<h4 id="org66a2bf1">New operators</h4>
<div class="outline-text-4" id="text-org66a2bf1">
<p>
A natural idea is to simplify the design of <code>RandomVariable</code>\s so that it is only responsible for one thing: create a random value from a PRNG state. The <code>Op</code> thus creates an <code>Apply</code> node that takes a <code>RandomState</code> as input and outputs a (random) <code>Variable</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell">RandomVariable :: RandomState -&gt; Variable
</pre>
</div>

<p>
We can now make the <code>RandState</code> output explicit (1) by making <code>rng</code> an explicit input of the <code>RandomVariable</code>'s <code>__call__</code> method. And we can verify in the following that the sequential dependency between <code>x_rv</code> and <code>y_rv</code> disappears:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">rng_x and rng_y are created before that.</span>
<span style="font-weight: bold; font-style: italic;">x_rv</span> = at.random.normal(rng_x, 0, 1)
<span style="font-weight: bold; font-style: italic;">y_rv</span> = at.random.normal(rng_y, 0, 1)
</pre>
</div>

<p>
This interface presupposes the existence of an operator that creates an updated <code>RandomState</code> from a <code>RandomState</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell">next :: RandomState -&gt; RandomState
</pre>
</div>

<p>
To be able to build reproducible programs (2), we also need an operator that creates a <code>RandomState</code> from a seed:
</p>

<div class="org-src-container">
<pre class="src src-haskell">default_rng :: Seed -&gt; RandomState
</pre>
</div>

<p>
We can thus fill in the blanks in the previous code snippet:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">rng</span> = at.random.default_rng(0)

<span style="font-weight: bold; font-style: italic;">rng_x</span> = at.random.<span style="font-weight: bold;">next</span>(rng)
<span style="font-weight: bold; font-style: italic;">x_rv</span> = at.random.normal(rng_x, 0, 1)

<span style="font-weight: bold; font-style: italic;">rng_y</span> = at.random.<span style="font-weight: bold;">next</span>(rng_x)
<span style="font-weight: bold; font-style: italic;">y_rv</span> = at.random.normal(rng_y, 0, 1)

<span style="font-weight: bold; font-style: italic;">z_at</span> = x_rv + y_rv
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">rng</span> = at.random.<span style="font-weight: bold;">type</span>.RandomGeneratorType()(<span style="font-style: italic;">"rng"</span>)

<span style="font-weight: bold; font-style: italic;">rng_x</span>, <span style="font-weight: bold; font-style: italic;">x_rv</span> = at.random.normal(0,1, rng=rng).owner.outputs
<span style="font-weight: bold; font-style: italic;">rng_y</span>, <span style="font-weight: bold; font-style: italic;">y_rv</span> = at.random.normal(0,1, rng=rng_x).owner.outputs

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">next</span>(rng):
    <span style="font-weight: bold; font-style: italic;">bit_generator</span> = rng.bit_generator.advance(1)
    <span style="font-weight: bold;">return</span> np.random.Generator(bit_generator)

</pre>
</div>

<p>
This code generates Aesara graphs that are very similar to the ones generated by <code>RandomStream</code>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream()

<span style="font-weight: bold; font-style: italic;">x_rv</span> = srng.normal(0, 1)
<span style="font-weight: bold; font-style: italic;">y_rv</span> = srng.normal(0, 1)
<span style="font-weight: bold; font-style: italic;">z_at</span> = x_rv + y_rv
</pre>
</div>

<p>
Roughly speaking, <code>RandomStream</code> moves this "next" mechanism to the <i>updates</i> graph, while this symbolic representation of the state of the PRNG makes it explicit in the same graph. The graph between <code>RandomState</code>\s in the proposed scheme is a concretization of the updates graph for the <code>RandomStream</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara
<span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(seed=123)
<span style="font-weight: bold; font-style: italic;">x_rv</span> = srng.normal()
<span style="font-weight: bold; font-style: italic;">y_rv</span> = srng.normal()
<span style="font-weight: bold; font-style: italic;">z_at</span> = x_rv + y_rv

aesara.dprint(y_rv.owner.inputs[0].default_update)
</pre>
</div>

<p>
Let us now consider a more complex situation, when <code>call_x</code> and <code>call_y</code> are two functions that require a <code>RandomState</code>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">rng</span> = at.random.default_rng(0)

<span style="font-weight: bold; font-style: italic;">rng_x</span> = at.random.<span style="font-weight: bold;">next</span>(rng)
<span style="font-weight: bold; font-style: italic;">x_rv</span> = call_x(rng_x)

<span style="font-weight: bold; font-style: italic;">rng_y</span> = at.random.<span style="font-weight: bold;">next</span>(rng_x)
<span style="font-weight: bold; font-style: italic;">y_rv</span> = call_y(rng_y)

<span style="font-weight: bold; font-style: italic;">z_at</span> = x_rv + y_rv
</pre>
</div>

<p>
We can easily make the previous code generate a collision:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">call_x</span>(rng_a):
    <span style="font-weight: bold; font-style: italic;">a_rv</span> = at.random.normal(rng_a, 0, 1)
    <span style="font-weight: bold; font-style: italic;">rng_b</span> = at.random.<span style="font-weight: bold;">next</span>(rng_a)
    <span style="font-weight: bold; font-style: italic;">b_rv</span> = at.random.normal(rng_b, 0, 1)
    <span style="font-weight: bold;">return</span> a_rv * b_rv
</pre>
</div>

<p>
The issue arises because our symbolic structure is <i>linear</i>: each <code>RandState</code> has one and only one ancestor. What we need instead is to allow <code>RandState</code>\s to have several ancestors; We thus define the <code>at.random.op.Split</code> operator:
</p>

<div class="org-src-container">
<pre class="src src-haskell">split :: RandState -&gt; (RandState, RandState)
</pre>
</div>

<p>
This can be easily implemented: if <code>RandState</code> is a binary number &lt;..&gt; then the leftmost key is obtained by appending <code>0</code>, the rightmost <code>1</code>. Any succession of splitting operations builds a binary tree. If <code>Rand</code> is a deterministic function of this value, then the computations are fully reproducible. This binary tree structure is encoded directly in the graph IR:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">rng</span> = at.random.default_rng(0)
<span style="font-weight: bold; font-style: italic;">rng_x</span>, <span style="font-weight: bold; font-style: italic;">rng_y</span> = at.random.split(rng)

etuplize(rng_x)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">etuple(nth, 0, etuple(at.random.split, etuple(at.random.default_rng, 0)))</span>

etuplize(rng_y)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">etuple(nth, 1, etuple(at.random.split, etuple(at.random.default_rng, 0)))</span>
</pre>
</div>

<p>
Although it may be possible to keep <code>Next</code> within this representation, its interaction with the <code>Split</code> operator requires careful thought. We forget it for now, as <code>Split</code> is expressive enough. The original program becomes:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">rng</span> = at.random.default_rng()
<span style="font-weight: bold; font-style: italic;">rng_x</span>, <span style="font-weight: bold; font-style: italic;">rng_y</span> = at.random.split(rng)

<span style="font-weight: bold; font-style: italic;">x_rv</span> = at.random.normal(rng_x, 0, 1)
<span style="font-weight: bold; font-style: italic;">y_rv</span> = at.random.normal(rng_y, 0, 1)
<span style="font-weight: bold; font-style: italic;">z_at</span> = x_rv + y_rv
</pre>
</div>

<p>
It is also natural to implement the <code>at.random.op.SplitN</code> operator represented by:
</p>

<div class="org-src-container">
<pre class="src src-haskell">splitn :: RandState -&gt; Int -&gt; (RandState, ..., RandState)
</pre>
</div>

<p>
So we can write the following code:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">at.random.split</span> = at.random.Split()

<span style="font-weight: bold; font-style: italic;">rng</span> = at.random.default_rng()
<span style="font-weight: bold; font-style: italic;">rng_v</span>, <span style="font-weight: bold; font-style: italic;">rng_w</span>, <span style="font-weight: bold; font-style: italic;">rng_x</span>, <span style="font-weight: bold; font-style: italic;">rng_y</span> = at.random.splitn(rng, 4)

<span style="font-weight: bold; font-style: italic;">v_rv</span> = at.random.normal(rng_y, 0, 1)
<span style="font-weight: bold; font-style: italic;">w_rv</span> = at.random.normal(rng_x, 0, 1)
<span style="font-weight: bold; font-style: italic;">x_rv</span> = at.random.normal(rng_x, 0, 1)
<span style="font-weight: bold; font-style: italic;">y_rv</span> = at.random.normal(rng_y, 0, 1)
<span style="font-weight: bold; font-style: italic;">z_at</span> = v_rv + w_rv + x_rv + z_rv
</pre>
</div>

<p>
This will prove useful e.g. for use with generalized universal functions.
</p>

<p>
A nice consequence of this "splitting" design is that the graph that updates the <code>RandomState</code>\s is always neatly separated from the "main" graph that contains the <code>RandomVariable</code>\s. Does this help with rewrites?
</p>



<p>
Counter-based RNGs are now ubiquitous, in NumPy, JAX, XLA, PyTorch, etc so we can mostly rely on their design for <code>RandomState</code>
</p>
</div>
</div>
