org/20220802094127-random_variables_in_aesara.org
*** Implementation

Let us sketch an implementation in Aesara. First we need an implementation of =RandState=:

#+begin_src python :session :results silent
from typing import NamedTuple

class RandState(NamedTuple):
    key: int
    path: int
#+end_src


Here =key= is the seed given by the user. If not provided, it will be chosen at random at compilation. =path= is the path to this RNG state in the RNG graph, and is represented as bits. A naive implementation of the =split= operator is thus:

#+begin_src python :session :results output
def split(rng):
    left_rng = RandomState(rng.key, (rng.path << 1))
    right_rng = RandomState(rng.key, (rng.path << 1) + 1)
    return left_rng, right_rng

rng = RandomState(10, 0b011101)
print(rng)

left, right = split(rng)
print(left, right)
#+end_src

#+RESULTS:
: RandomState(key=10, path=29)
: RandomState(key=10, path=58) RandomState(key=10, path=59)

It is naive in the sense that the counter space $\mathcal{S}$ of real PRNGs does not usually extend indefinitely ($128$ for Philox in NumPy). In practice we will need to walk the graph and compress the state by incrementing the =key= as well, but this can be done at compile time once information about the =BitGenerator= is known. However, we might need to use Philox' hash function as the state progresses to be immediately compatible with NumPy in the =perform= function. Since we can still walk the =RandState= tree in our representation this should not affect it too much.

#+begin_src python :session :results output
left = RandomState(10, 0b01)
print(left)
for _ in range(100):
    left, _ = split(left)
print(left)
#+end_src

#+RESULTS:
: RandomState(key=10, path=1)
: RandomState(key=10, path=1267650600228229401496703205376)

This can easily be translated to an Aesara =Op=. The =RandomVariable= Ops are slightly changed, we need to modify their =__call__=, =make_node= and =perform= things:

#+begin_src python
from aesara.graph.op import Op


class RandomVariable(Op)
    def __call__(self, rng, *args, size=None, name=None, dtype=None, **kwargs):
        res = super().__call__(rng, size, dtype, *args, **kwargs)

        if name is not None:
            res.name = name

        return res

    def make_node(self, rng, size, dtype, *dist_params):
        """Create a random variable node.

        Parameters
        ----------
        rng: RandState
        size: int or Sequence
            NumPy-like size parameter.
        dtype: str
            The dtype of the sampled output.  If the value ``"floatX"`` is
            given, then `dtype` is set to ``aesara.config.floatX``.  This value is
            only used when ``self.dtype`` isn't set.
        dist_params: list
            Distribution parameters.

        Results
        -------
        out: Apply
            A node with inputs ``(rng, size, dtype) + dist_args`` and outputs
            ``(out_var)``.

        """
        size = normalize_size_param(size)

        dist_params = tuple(
            as_tensor_variable(p) if not isinstance(p, Variable) else p
            for p in dist_params
        )

        # `rng` needs to be explicitly provided.
        # if rng is None:
        #     rng = aesara.shared(np.random.default_rng())
        # elif not isinstance(rng.type, RandomType):
        #     raise TypeError(
        #         "The type of rng should be an instance of either RandomGeneratorType or RandomStateType"
        #     )

        shape = self._infer_shape(size, dist_params)
        _, bcast = infer_broadcastable(shape)
        dtype = self.dtype or dtype

        if dtype == "floatX":
            dtype = config.floatX
        elif dtype is None or (isinstance(dtype, str) and dtype not in all_dtypes):
            raise TypeError("dtype is unspecified")

        if isinstance(dtype, str):
            dtype_idx = constant(all_dtypes.index(dtype), dtype="int64")
        else:
            dtype_idx = constant(dtype, dtype="int64")
            dtype = all_dtypes[dtype_idx.data]

        outtype = TensorType(dtype=dtype, shape=bcast)
        out_var = outtype()
        inputs = (rng, size, dtype_idx) + dist_params
        output = (out_var,)

        return Apply(self, inputs, outputs)

    def perform(self, node, inputs, outputs):
        smpl_out = outputs
        rng, size, dtype, *args = inputs

        out_var = node.outputs[1]

        # If `size == []`, that means no size is enforced, and NumPy is trusted
        # to draw the appropriate number of samples, NumPy uses `size=None` to
        # represent that.  Otherwise, NumPy expects a tuple.
        if np.size(size) == 0:
            size = None
        else:
            size = tuple(size)

        ##----------------------##
        ##  THE IMPORTANT STUFF ##
        ##----------------------##
        rng = np.random.Generator(np.random.Philox(key=rng.key, counter=rng.counter))
        smpl_val = self.rng_fn(rng, *(args + [size]))
        ##----------------------##
        ##  THE IMPORTANT STUFF ##
        ##----------------------##

        if (
            not isinstance(smpl_val, np.ndarray)
            or str(smpl_val.dtype) != out_var.type.dtype
        ):
            smpl_val = _asarray(smpl_val, dtype=out_var.type.dtype)

        smpl_out[0] = smpl_val

    def rng_fn(self, rng, *args, **kwargs):
        """Sample a numeric random variate."""
        return getattr(rng, self.name)(*args, **kwargs)
#+end_src

We can keep the =RandomStream= API as follows by making it handle the splitting internally. It could even be an =OpFromGraph=?

#+begin_src python
def gen(self, op: "RandomVariable", *args, **kwargs) -> TensorVariable:
    r"""Generate a draw from `op` seeded from this `RandomStream`.

    Parameters
    ----------
    op
        A `RandomVariable` instance
    args
        Positional arguments passed to `op`.
    kwargs
        Keyword arguments passed to `op`.

    Returns
    -------
    The symbolic random draw performed by `op`.  This function stores
    the updated `RandomType`\s for use at compile time.

    """
    if "rng" in kwargs:
        raise ValueError(
            "The `rng` option cannot be used with a variate in a `RandomStream`"
        )

    # Update the random state and take a sample
    _, self.rng = at.random.split(self.rng)
    out = op(self.rng, *args, **kwargs)

    # This is the value that should be used to replace the old state
    # (i.e. `rng`) after `out` is sampled/evaluated.
    # The updates mechanism in `aesara.function` is supposed to perform
    # this replace action.
    new_rng = out.owner.outputs[0]

    self.state_updates.append((rng, new_rng))  # happens here

    rng.default_update = new_rng

    return out
#+end_src

