20220802094127-random_variables_in_aesara.html

<div id="outline-container-org6fd5a21" class="outline-4">
<h4 id="org6fd5a21">Implementation</h4>
<div class="outline-text-4" id="text-org6fd5a21">
<p>
Let us sketch an implementation in Aesara. First we need an implementation of <code>RandState</code>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> NamedTuple

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">RandState</span>(NamedTuple):
    key: <span style="font-weight: bold;">int</span>
    path: <span style="font-weight: bold;">int</span>
</pre>
</div>


<p>
Here <code>key</code> is the seed given by the user. If not provided, it will be chosen at random at compilation. <code>path</code> is the path to this RNG state in the RNG graph, and is represented as bits. A naive implementation of the <code>split</code> operator is thus:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">split</span>(rng):
    <span style="font-weight: bold; font-style: italic;">left_rng</span> = RandomState(rng.key, (rng.path &lt;&lt; 1))
    <span style="font-weight: bold; font-style: italic;">right_rng</span> = RandomState(rng.key, (rng.path &lt;&lt; 1) + 1)
    <span style="font-weight: bold;">return</span> left_rng, right_rng

<span style="font-weight: bold; font-style: italic;">rng</span> = RandomState(10, 0b011101)
<span style="font-weight: bold;">print</span>(rng)

<span style="font-weight: bold; font-style: italic;">left</span>, <span style="font-weight: bold; font-style: italic;">right</span> = split(rng)
<span style="font-weight: bold;">print</span>(left, right)
</pre>
</div>

<p>
It is naive in the sense that the counter space \(\mathcal{S}\) of real PRNGs does not usually extend indefinitely (\(128\) for Philox in NumPy). In practice we will need to walk the graph and compress the state by incrementing the <code>key</code> as well, but this can be done at compile time once information about the <code>BitGenerator</code> is known. However, we might need to use Philox' hash function as the state progresses to be immediately compatible with NumPy in the <code>perform</code> function. Since we can still walk the <code>RandState</code> tree in our representation this should not affect it too much.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">left</span> = RandomState(10, 0b01)
<span style="font-weight: bold;">print</span>(left)
<span style="font-weight: bold;">for</span> _ <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(100):
    <span style="font-weight: bold; font-style: italic;">left</span>, <span style="font-weight: bold; font-style: italic;">_</span> = split(left)
<span style="font-weight: bold;">print</span>(left)
</pre>
</div>

<p>
This can easily be translated to an Aesara <code>Op</code>. The <code>RandomVariable</code> Ops are slightly changed, we need to modify their <code>__call__</code>, <code>make_node</code> and <code>perform</code> things:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> aesara.graph.op <span style="font-weight: bold;">import</span> Op


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">RandomVariable</span>(Op)
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__call__</span>(<span style="font-weight: bold;">self</span>, rng, *args, size=<span style="font-weight: bold; text-decoration: underline;">None</span>, name=<span style="font-weight: bold; text-decoration: underline;">None</span>, dtype=<span style="font-weight: bold; text-decoration: underline;">None</span>, **kwargs):
        <span style="font-weight: bold; font-style: italic;">res</span> = <span style="font-weight: bold;">super</span>().__call__(rng, size, dtype, *args, **kwargs)

        <span style="font-weight: bold;">if</span> name <span style="font-weight: bold;">is</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
            <span style="font-weight: bold; font-style: italic;">res.name</span> = name

        <span style="font-weight: bold;">return</span> res

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">make_node</span>(<span style="font-weight: bold;">self</span>, rng, size, dtype, *dist_params):
        <span style="font-style: italic;">"""Create a random variable node.</span>

<span style="font-style: italic;">        Parameters</span>
<span style="font-style: italic;">        ----------</span>
<span style="font-style: italic;">        rng: RandState</span>
<span style="font-style: italic;">        size: int or Sequence</span>
<span style="font-style: italic;">            NumPy-like size parameter.</span>
<span style="font-style: italic;">        dtype: str</span>
<span style="font-style: italic;">            The dtype of the sampled output.  If the value ``"floatX"`` is</span>
<span style="font-style: italic;">            given, then `dtype` is set to ``aesara.config.floatX``.  This value is</span>
<span style="font-style: italic;">            only used when ``self.dtype`` isn't set.</span>
<span style="font-style: italic;">        dist_params: list</span>
<span style="font-style: italic;">            Distribution parameters.</span>

<span style="font-style: italic;">        Results</span>
<span style="font-style: italic;">        -------</span>
<span style="font-style: italic;">        out: Apply</span>
<span style="font-style: italic;">            A node with inputs ``(rng, size, dtype) + dist_args`` and outputs</span>
<span style="font-style: italic;">            ``(out_var)``.</span>

<span style="font-style: italic;">        """</span>
        <span style="font-weight: bold; font-style: italic;">size</span> = normalize_size_param(size)

        <span style="font-weight: bold; font-style: italic;">dist_params</span> = <span style="font-weight: bold;">tuple</span>(
            as_tensor_variable(p) <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">isinstance</span>(p, Variable) <span style="font-weight: bold;">else</span> p
            <span style="font-weight: bold;">for</span> p <span style="font-weight: bold;">in</span> dist_params
        )

        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">`rng` needs to be explicitly provided.</span>
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">if rng is None:</span>
        <span style="font-weight: bold; font-style: italic;">#     </span><span style="font-weight: bold; font-style: italic;">rng = aesara.shared(np.random.default_rng())</span>
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">elif not isinstance(rng.type, RandomType):</span>
        <span style="font-weight: bold; font-style: italic;">#     </span><span style="font-weight: bold; font-style: italic;">raise TypeError(</span>
        <span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">"The type of rng should be an instance of either RandomGeneratorType or RandomStateType"</span>
        <span style="font-weight: bold; font-style: italic;">#     </span><span style="font-weight: bold; font-style: italic;">)</span>

        <span style="font-weight: bold; font-style: italic;">shape</span> = <span style="font-weight: bold;">self</span>._infer_shape(size, dist_params)
        <span style="font-weight: bold; font-style: italic;">_</span>, <span style="font-weight: bold; font-style: italic;">bcast</span> = infer_broadcastable(shape)
        <span style="font-weight: bold; font-style: italic;">dtype</span> = <span style="font-weight: bold;">self</span>.dtype <span style="font-weight: bold;">or</span> dtype

        <span style="font-weight: bold;">if</span> dtype == <span style="font-style: italic;">"floatX"</span>:
            <span style="font-weight: bold; font-style: italic;">dtype</span> = config.floatX
        <span style="font-weight: bold;">elif</span> dtype <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">or</span> (<span style="font-weight: bold;">isinstance</span>(dtype, <span style="font-weight: bold;">str</span>) <span style="font-weight: bold;">and</span> dtype <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">in</span> all_dtypes):
            <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">TypeError</span>(<span style="font-style: italic;">"dtype is unspecified"</span>)

        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(dtype, <span style="font-weight: bold;">str</span>):
            <span style="font-weight: bold; font-style: italic;">dtype_idx</span> = constant(all_dtypes.index(dtype), dtype=<span style="font-style: italic;">"int64"</span>)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold; font-style: italic;">dtype_idx</span> = constant(dtype, dtype=<span style="font-style: italic;">"int64"</span>)
            <span style="font-weight: bold; font-style: italic;">dtype</span> = all_dtypes[dtype_idx.data]

        <span style="font-weight: bold; font-style: italic;">outtype</span> = TensorType(dtype=dtype, shape=bcast)
        <span style="font-weight: bold; font-style: italic;">out_var</span> = outtype()
        <span style="font-weight: bold; font-style: italic;">inputs</span> = (rng, size, dtype_idx) + dist_params
        <span style="font-weight: bold; font-style: italic;">output</span> = (out_var,)

        <span style="font-weight: bold;">return</span> Apply(<span style="font-weight: bold;">self</span>, inputs, outputs)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">perform</span>(<span style="font-weight: bold;">self</span>, node, inputs, outputs):
        <span style="font-weight: bold; font-style: italic;">smpl_out</span> = outputs
        rng, size, dtype, *<span style="font-weight: bold; font-style: italic;">args</span> = inputs

        <span style="font-weight: bold; font-style: italic;">out_var</span> = node.outputs[1]

        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">If `size == []`, that means no size is enforced, and NumPy is trusted</span>
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">to draw the appropriate number of samples, NumPy uses `size=None` to</span>
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">represent that.  Otherwise, NumPy expects a tuple.</span>
        <span style="font-weight: bold;">if</span> np.size(size) == 0:
            <span style="font-weight: bold; font-style: italic;">size</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold; font-style: italic;">size</span> = <span style="font-weight: bold;">tuple</span>(size)

        <span style="font-weight: bold; font-style: italic;">##</span><span style="font-weight: bold; font-style: italic;">----------------------##</span>
        <span style="font-weight: bold; font-style: italic;">##  </span><span style="font-weight: bold; font-style: italic;">THE IMPORTANT STUFF ##</span>
        <span style="font-weight: bold; font-style: italic;">##</span><span style="font-weight: bold; font-style: italic;">----------------------##</span>
        <span style="font-weight: bold; font-style: italic;">rng</span> = np.random.Generator(np.random.Philox(key=rng.key, counter=rng.counter))
        <span style="font-weight: bold; font-style: italic;">smpl_val</span> = <span style="font-weight: bold;">self</span>.rng_fn(rng, *(args + [size]))
        <span style="font-weight: bold; font-style: italic;">##</span><span style="font-weight: bold; font-style: italic;">----------------------##</span>
        <span style="font-weight: bold; font-style: italic;">##  </span><span style="font-weight: bold; font-style: italic;">THE IMPORTANT STUFF ##</span>
        <span style="font-weight: bold; font-style: italic;">##</span><span style="font-weight: bold; font-style: italic;">----------------------##</span>

        <span style="font-weight: bold;">if</span> (
            <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">isinstance</span>(smpl_val, np.ndarray)
            <span style="font-weight: bold;">or</span> <span style="font-weight: bold;">str</span>(smpl_val.dtype) != out_var.<span style="font-weight: bold;">type</span>.dtype
        ):
            <span style="font-weight: bold; font-style: italic;">smpl_val</span> = _asarray(smpl_val, dtype=out_var.<span style="font-weight: bold;">type</span>.dtype)

        <span style="font-weight: bold; font-style: italic;">smpl_out</span>[0] = smpl_val

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">rng_fn</span>(<span style="font-weight: bold;">self</span>, rng, *args, **kwargs):
        <span style="font-style: italic;">"""Sample a numeric random variate."""</span>
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">getattr</span>(rng, <span style="font-weight: bold;">self</span>.name)(*args, **kwargs)
</pre>
</div>

<p>
We can keep the <code>RandomStream</code> API as follows by making it handle the splitting internally. It could even be an <code>OpFromGraph</code>?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">gen</span>(<span style="font-weight: bold;">self</span>, op: <span style="font-style: italic;">"RandomVariable"</span>, *args, **kwargs) -&gt; TensorVariable:
    r<span style="font-style: italic;">"""Generate a draw from `op` seeded from this `RandomStream`.</span>

<span style="font-style: italic;">    Parameters</span>
<span style="font-style: italic;">    ----------</span>
<span style="font-style: italic;">    op</span>
<span style="font-style: italic;">        A `RandomVariable` instance</span>
<span style="font-style: italic;">    args</span>
<span style="font-style: italic;">        Positional arguments passed to `op`.</span>
<span style="font-style: italic;">    kwargs</span>
<span style="font-style: italic;">        Keyword arguments passed to `op`.</span>

<span style="font-style: italic;">    Returns</span>
<span style="font-style: italic;">    -------</span>
<span style="font-style: italic;">    The symbolic random draw performed by `op`.  This function stores</span>
<span style="font-style: italic;">    the updated `RandomType`\s for use at compile time.</span>

<span style="font-style: italic;">    """</span>
    <span style="font-weight: bold;">if</span> <span style="font-style: italic;">"rng"</span> <span style="font-weight: bold;">in</span> kwargs:
        <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">ValueError</span>(
            <span style="font-style: italic;">"The `rng` option cannot be used with a variate in a `RandomStream`"</span>
        )

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Update the random state and take a sample</span>
    <span style="font-weight: bold; font-style: italic;">_</span>, <span style="font-weight: bold;">self</span>.rng = at.random.split(<span style="font-weight: bold;">self</span>.rng)
    <span style="font-weight: bold; font-style: italic;">out</span> = op(<span style="font-weight: bold;">self</span>.rng, *args, **kwargs)

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">This is the value that should be used to replace the old state</span>
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">(i.e. `rng`) after `out` is sampled/evaluated.</span>
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">The updates mechanism in `aesara.function` is supposed to perform</span>
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">this replace action.</span>
    <span style="font-weight: bold; font-style: italic;">new_rng</span> = out.owner.outputs[0]

    <span style="font-weight: bold;">self</span>.state_updates.append((rng, new_rng))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">happens here</span>

    <span style="font-weight: bold; font-style: italic;">rng.default_update</span> = new_rng

    <span style="font-weight: bold;">return</span> out
</pre>
</div>
</div>
</div>
