org/20220802094127-random_variables_in_aesara.org
*** Etuplization

These new operators simplify greatly the work with etuplized versions of graphs with random variables. Assuming we have a =Nth= operator in Aesara as well:

#+begin_src python
from etuples import ExpressionTuple, etuplize
from aesara.graph.rewriting.unify import OpExpressionTuple

rng = at.random.default_rng()
rng_x, rng_y = at.random.split(rng)
x_rv = at.random.normal(rng_x, 0, 1)
y_rv = at.random.normal(rng_y, 0, 1)
z_at = x_rv + y_rv

z_et = OpExpressionTuple(
    etuplize(at.add),
    OpExpressionTuple(
        etuplize(at.random.normal),
        ExpressionTuple(
           etuplize(aesara.graph.nth),
           1,
           OpExpressionTuple(
               etuplize(at.random.split)
               rng
           )
        ),
        0,
        1,
        size,
        dtype,
    ),
    OpExpressionTuple(
        etuplize(at.random.normal),
        ExpressionTuple(
           etuplize(aesara.graph.nth),
           0,
           OpExpressionTuple(
               etuplize(at.random.split)
               rng
           )
        ),
        0,
        1,
        size,
        dtype,
    ),
)
#+end_src

This solves the one-to-many problem we had for mixtures. If we have a relation between a single random variable and two we can now write:

#+begin_src python
z_et = etuple(etuplize(at.random.normal), rng_lv, size_lv, dtype_lv, at.as_tensor(1.), at.as_tensor(2.))

sum_et = etuple(
    etuplize(at.add),
    etuple(
        etuplize(at.random.normal),
        etuple(
            etuplize(at.graph.nth),
            0,
            etuple(
                etuplize(at.random.split),
                rng_lv,
            )
        )
        size_lv,
        dtype_lv,
        at.as_tensor(0.),
        at.as_tensor(1.),
    ),
    etuple(
        etuplize(at.random.normal),
        etuple(
            etuplize(at.graph.nth),
            1,
            etuple(
                etuplize(at.random.split),
                rng_lv,
            )
        )
        size_lv,
        dtype_lv,
        at.as_tensor(0.),
        at.as_tensor(1.),
    )
)
#+end_src

*** Behavior under transpilation

**** JAX

Transpilation to JAX would be straightforward, as JAX [[https://jax.readthedocs.io/en/latest/jep/263-prng.html][uses a splittable PRNG representation]]. We will simply need to perform the following substitutions:

#+begin_src python
rng = at.random.RandomState()
rng_key = jax.random.PRNGKey()

at.random.split(rng)
jax.random.split(rng_key)

at.random.splitn(rng, 10)
jax.random.split(rng_key, 10)
#+end_src

**** Numba

After [[https://github.com/aesara-devs/aesara/pull/1245][#1245]] Aesara will support NumPy's Generator API. NumPy has support for [[https://numpy.org/doc/stable/reference/random/bit_generators/philox.html][Philox as a BitGenerator]]. Philox is a [[http://www.thesalmons.org/john/random123/papers/random123sc11.pdf][counter-based PRNG]] which can easily accomodate [[https://publications.lib.chalmers.se/records/fulltext/183348/local_183348.pdf][splittable PRNG representations]]. We can directly translate the =RandomVariable=\s to NumPy =Generator=\s and seed these generators at compile time:

#+begin_src python
at.random.normal(rng, 0, 1)

# This happens at compile time
counter, key = rng_index_to_key_counter(rng)

# Now we can seed the rng
rng = np.random.Generator(np.random.Philox(counter=counter, key=key))
rng.normal(0, 1)
#+end_src

Alternatively, we could interpret the structure of the RNG-Variables graph, initialize one =np.random.Generator= and use the =jumped= and =advance= methods of the Philox =BitGenerator=.

* RandomVariable Ops

We have a =default_rng= function, but the result does not behave as a generator in =numpy=.

#+begin_src python :session
from aesara.tensor.random import default_rng
rng = default_rng(32)
rng.type
#+end_src

#+RESULTS:
: RandomGeneratorType


#+begin_src python :session
from aesara.tensor.random.basic import NormalRV

norm = NormalRV()
norm_rv = norm(0, 1, size=(2,), rng=rng)

norm_rv.eval()
#+end_src

#+RESULTS:
| -0.0242532 | 0.72212055 |


=Aesara= also defines aliases for the =RandomVariable= Ops:

#+begin_src python :session
from aesara.tensor.random import normal

normal_rv = normal(0, 1, size=(2,), rng=rng)
normal_rv.eval()
#+end_src

#+RESULTS:
| 0.93330371 | -0.22801103 |

Let's look at the graphs that are produced:

#+begin_src python :results output
import aesara
from aesara.tensor.random import default_rng, normal

rng = default_rng(0)
a_rv = normal(0, 1, rng=rng)
b_rv = normal(0, 1, rng=rng)
c_tt = a_rv + b_rv

d_rv = normal(0, 1, rng=rng)

aesara.dprint(c_tt * d_rv)
#+end_src

#+RESULTS:
#+begin_example
Elemwise{mul,no_inplace} [id A]
 |Elemwise{add,no_inplace} [id B]
 | |normal_rv{0, (0, 0), floatX, False}.1 [id C]
 | | |DefaultGeneratorMakerOp [id D]
 | | | |TensorConstant{0} [id E]
 | | |TensorConstant{[]} [id F]
 | | |TensorConstant{11} [id G]
 | | |TensorConstant{0} [id H]
 | | |TensorConstant{1} [id I]
 | |normal_rv{0, (0, 0), floatX, False}.1 [id J]
 |   |DefaultGeneratorMakerOp [id D]
 |   |TensorConstant{[]} [id K]
 |   |TensorConstant{11} [id L]
 |   |TensorConstant{0} [id M]
 |   |TensorConstant{1} [id N]
 |normal_rv{0, (0, 0), floatX, False}.1 [id O]
   |DefaultGeneratorMakerOp [id D]
   |TensorConstant{[]} [id P]
   |TensorConstant{11} [id Q]
   |TensorConstant{0} [id R]
   |TensorConstant{1} [id S]
#+end_example


How does =RandomGeneratorType= work? It looks like it has internal state.

