20220802094127-random_variables_in_aesara.html

<div id="outline-container-orgfb76cac" class="outline-4">
<h4 id="orgfb76cac">Etuplization</h4>
<div class="outline-text-4" id="text-orgfb76cac">
<p>
These new operators simplify greatly the work with etuplized versions of graphs with random variables. Assuming we have a <code>Nth</code> operator in Aesara as well:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> etuples <span style="font-weight: bold;">import</span> ExpressionTuple, etuplize
<span style="font-weight: bold;">from</span> aesara.graph.rewriting.unify <span style="font-weight: bold;">import</span> OpExpressionTuple

<span style="font-weight: bold; font-style: italic;">rng</span> = at.random.default_rng()
<span style="font-weight: bold; font-style: italic;">rng_x</span>, <span style="font-weight: bold; font-style: italic;">rng_y</span> = at.random.split(rng)
<span style="font-weight: bold; font-style: italic;">x_rv</span> = at.random.normal(rng_x, 0, 1)
<span style="font-weight: bold; font-style: italic;">y_rv</span> = at.random.normal(rng_y, 0, 1)
<span style="font-weight: bold; font-style: italic;">z_at</span> = x_rv + y_rv

<span style="font-weight: bold; font-style: italic;">z_et</span> = OpExpressionTuple(
    etuplize(at.add),
    OpExpressionTuple(
        etuplize(at.random.normal),
        ExpressionTuple(
           etuplize(aesara.graph.nth),
           1,
           OpExpressionTuple(
               etuplize(at.random.split)
               rng
           )
        ),
        0,
        1,
        size,
        dtype,
    ),
    OpExpressionTuple(
        etuplize(at.random.normal),
        ExpressionTuple(
           etuplize(aesara.graph.nth),
           0,
           OpExpressionTuple(
               etuplize(at.random.split)
               rng
           )
        ),
        0,
        1,
        size,
        dtype,
    ),
)
</pre>
</div>

<p>
This solves the one-to-many problem we had for mixtures. If we have a relation between a single random variable and two we can now write:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">z_et</span> = etuple(etuplize(at.random.normal), rng_lv, size_lv, dtype_lv, at.as_tensor(1.), at.as_tensor(2.))

<span style="font-weight: bold; font-style: italic;">sum_et</span> = etuple(
    etuplize(at.add),
    etuple(
        etuplize(at.random.normal),
        etuple(
            etuplize(at.graph.nth),
            0,
            etuple(
                etuplize(at.random.split),
                rng_lv,
            )
        )
        size_lv,
        dtype_lv,
        at.as_tensor(0.),
        at.as_tensor(1.),
    ),
    etuple(
        etuplize(at.random.normal),
        etuple(
            etuplize(at.graph.nth),
            1,
            etuple(
                etuplize(at.random.split),
                rng_lv,
            )
        )
        size_lv,
        dtype_lv,
        at.as_tensor(0.),
        at.as_tensor(1.),
    )
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6bf1e1e" class="outline-4">
<h4 id="org6bf1e1e">Behavior under transpilation</h4>
<div class="outline-text-4" id="text-org6bf1e1e">
</div>
<ul class="org-ul">
<li><a id="orgbbffc03"></a>JAX<br />
<div class="outline-text-5" id="text-orgbbffc03">
<p>
Transpilation to JAX would be straightforward, as JAX <a target='_blank' rel='noopener noreferrer' class='external' href="https://jax.readthedocs.io/en/latest/jep/263-prng.html">uses a splittable PRNG representation</a>. We will simply need to perform the following substitutions:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">rng</span> = at.random.RandomState()
<span style="font-weight: bold; font-style: italic;">rng_key</span> = jax.random.PRNGKey()

at.random.split(rng)
jax.random.split(rng_key)

at.random.splitn(rng, 10)
jax.random.split(rng_key, 10)
</pre>
</div>
</div>
</li>

<li><a id="orgd239ccc"></a>Numba<br />
<div class="outline-text-5" id="text-orgd239ccc">
<p>
After <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aesara/pull/1245">#1245</a> Aesara will support NumPy's Generator API. NumPy has support for <a target='_blank' rel='noopener noreferrer' class='external' href="https://numpy.org/doc/stable/reference/random/bit_generators/philox.html">Philox as a BitGenerator</a>. Philox is a <a target='_blank' rel='noopener noreferrer' class='external' href="http://www.thesalmons.org/john/random123/papers/random123sc11.pdf">counter-based PRNG</a> which can easily accomodate <a target='_blank' rel='noopener noreferrer' class='external' href="https://publications.lib.chalmers.se/records/fulltext/183348/local_183348.pdf">splittable PRNG representations</a>. We can directly translate the <code>RandomVariable</code>\s to NumPy <code>Generator</code>\s and seed these generators at compile time:
</p>

<div class="org-src-container">
<pre class="src src-python">at.random.normal(rng, 0, 1)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">This happens at compile time</span>
<span style="font-weight: bold; font-style: italic;">counter</span>, <span style="font-weight: bold; font-style: italic;">key</span> = rng_index_to_key_counter(rng)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Now we can seed the rng</span>
<span style="font-weight: bold; font-style: italic;">rng</span> = np.random.Generator(np.random.Philox(counter=counter, key=key))
rng.normal(0, 1)
</pre>
</div>

<p>
Alternatively, we could interpret the structure of the RNG-Variables graph, initialize one <code>np.random.Generator</code> and use the <code>jumped</code> and <code>advance</code> methods of the Philox <code>BitGenerator</code>.
</p>
</div>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9813976" class="outline-2">
<h2 id="org9813976">RandomVariable Ops</h2>
<div class="outline-text-2" id="text-org9813976">
<p>
We have a <code>default_rng</code> function, but the result does not behave as a generator in <code>numpy</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> aesara.tensor.random <span style="font-weight: bold;">import</span> default_rng
<span style="font-weight: bold; font-style: italic;">rng</span> = default_rng(32)
rng.<span style="font-weight: bold;">type</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> aesara.tensor.random.basic <span style="font-weight: bold;">import</span> NormalRV

<span style="font-weight: bold; font-style: italic;">norm</span> = NormalRV()
<span style="font-weight: bold; font-style: italic;">norm_rv</span> = norm(0, 1, size=(2,), rng=rng)

norm_rv.<span style="font-weight: bold;">eval</span>()
</pre>
</div>


<p>
<code>Aesara</code> also defines aliases for the <code>RandomVariable</code> Ops:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> aesara.tensor.random <span style="font-weight: bold;">import</span> normal

<span style="font-weight: bold; font-style: italic;">normal_rv</span> = normal(0, 1, size=(2,), rng=rng)
normal_rv.<span style="font-weight: bold;">eval</span>()
</pre>
</div>

<p>
Let's look at the graphs that are produced:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara
<span style="font-weight: bold;">from</span> aesara.tensor.random <span style="font-weight: bold;">import</span> default_rng, normal

<span style="font-weight: bold; font-style: italic;">rng</span> = default_rng(0)
<span style="font-weight: bold; font-style: italic;">a_rv</span> = normal(0, 1, rng=rng)
<span style="font-weight: bold; font-style: italic;">b_rv</span> = normal(0, 1, rng=rng)
<span style="font-weight: bold; font-style: italic;">c_tt</span> = a_rv + b_rv

<span style="font-weight: bold; font-style: italic;">d_rv</span> = normal(0, 1, rng=rng)

aesara.dprint(c_tt * d_rv)
</pre>
</div>


<p>
How does <code>RandomGeneratorType</code> work? It looks like it has internal state.
</p>
</div>
</div>
