org/20220802094127-random_variables_in_aesara.org
* Sampling vs Logprobability =aeppl=
- How define the logprob of a custom distribution?

* Shapes

Shapes are always a mess when it comes to random variables. In =aesara= we note two distinct shapes:
- =ndim_supp= the number of dimensions of the RV's support.
- =ndim_params=
- =size= which is the sample size

Remember that shapes in Aesara can be determined at runtime! So if we assume that:

#+begin_src python
batch_shape = size
np.ndim(sample_shape) = ndim_supp
shape = sample_shape + batch_shape
#+end_src

And we should have a look at broadcasting rules because they are not all very obvious.

#+begin_src python :session :results output
import aesara.tensor as at
from aesara.tensor.random import RandomStream

srng = RandomStream(0)
a_rv = srng.normal(0, 1, size=(2,3))
print(a_rv.eval())
#+end_src

#+RESULTS:
: [[ 1.44369095 -0.89594598  0.73595567]
:  [ 0.00587704  0.85338179  0.16094803]]

#+begin_src python :session :results output
mu = at.as_tensor([1., 2., 3.])
a_rv = srng.normal(mu, 1, size=(2,3))
print(a_rv.eval())
#+end_src

#+RESULTS:
: [[0.05413093 1.105416   4.68806659]
:  [0.63396273 1.38008182 1.99801801]]

#+begin_src python :session :results output
mu = at.as_tensor([1., 2.])
a_rv = srng.normal(mu, 1, size=(2,3))
print(a_rv.eval())
#+end_src

#+RESULTS:

More complex is the case where the random variable is non-scalar, as multivariate normal. Here you can see that the "event shape" is equal to 2. The resulting shape, if we assume =event_shape= and =batch_shape= are tuples is given by:

#+begin_src python
shape = event_shape + batch_shape
#+end_src

#+begin_src python :session :results output
import numpy as np

mu = np.r_[1, 2]
sigma = np.array([[.5, .5], [.4, .6]])
a_rv = srng.multivariate_normal(mu, sigma, size=(2, 5))
print(a_rv.eval().shape)
#+end_src

#+RESULTS:
: (2, 5, 2)

See [[https://ericmjl.github.io/blog/2019/5/29/reasoning-about-shapes-and-probability-distributions/][Eric Ma's blog post on the topic]].

* Problems with =RandomStream=

https://github.com/aesara-devs/aesara/pull/1211#discussion_r985057882

* Proposal

#+begin_src python
import aesara.tensor as at

rng = at.random.RandomState()

# RandomVariables divide the rng
a_rv, rng = at.random.normal(rng, 0, 1)
b_rv, _ = at.random.normal(rng, 0, 1)

# We have to update the rng manually
a_rv = at.random.normal(rng, 0, 1)
rng = at.random.update(rng)
b_rv = at.random.normal(rng, 0, 1)

rng_a, rng_b = at.random.split(rng)
a_rv = at.random.normal(rng_a, 0, 1)
b_rv = at.random.normal(rng_b, 0, 1)

rngs = at.random.split(rng, 10)
rvs = []
for rng in rngs:
    rvs.append(at.random.normal(rng, 0, 1))
#+end_src

How does that solve the previous issues?

1. Monkey patching to specialize the RV =Op=\s
2. RVs in S-expressions and rewrites

What does that complicate?

#+begin_src python

def standard_normal():

#+end_src
