20220802094127-random_variables_in_aesara.html

<div id="outline-container-org26e2f1c" class="outline-2">
<h2 id="org26e2f1c">Sampling vs Logprobability <code>aeppl</code></h2>
<div class="outline-text-2" id="text-org26e2f1c">
<ul class="org-ul">
<li>How define the logprob of a custom distribution?</li>
</ul>
</div>
</div>

<div id="outline-container-org51b0ced" class="outline-2">
<h2 id="org51b0ced">Shapes</h2>
<div class="outline-text-2" id="text-org51b0ced">
<p>
Shapes are always a mess when it comes to random variables. In <code>aesara</code> we note two distinct shapes:
</p>
<ul class="org-ul">
<li><code>ndim_supp</code> the number of dimensions of the RV's support.</li>
<li><code>ndim_params</code></li>
<li><code>size</code> which is the sample size</li>
</ul>

<p>
Remember that shapes in Aesara can be determined at runtime! So if we assume that:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">batch_shape</span> = size
np.ndim(sample_shape) = ndim_supp
<span style="font-weight: bold; font-style: italic;">shape</span> = sample_shape + batch_shape
</pre>
</div>

<p>
And we should have a look at broadcasting rules because they are not all very obvious.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">from</span> aesara.tensor.random <span style="font-weight: bold;">import</span> RandomStream

<span style="font-weight: bold; font-style: italic;">srng</span> = RandomStream(0)
<span style="font-weight: bold; font-style: italic;">a_rv</span> = srng.normal(0, 1, size=(2,3))
<span style="font-weight: bold;">print</span>(a_rv.<span style="font-weight: bold;">eval</span>())
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">mu</span> = at.as_tensor([1., 2., 3.])
<span style="font-weight: bold; font-style: italic;">a_rv</span> = srng.normal(mu, 1, size=(2,3))
<span style="font-weight: bold;">print</span>(a_rv.<span style="font-weight: bold;">eval</span>())
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">mu</span> = at.as_tensor([1., 2.])
<span style="font-weight: bold; font-style: italic;">a_rv</span> = srng.normal(mu, 1, size=(2,3))
<span style="font-weight: bold;">print</span>(a_rv.<span style="font-weight: bold;">eval</span>())
</pre>
</div>

<p>
More complex is the case where the random variable is non-scalar, as multivariate normal. Here you can see that the "event shape" is equal to 2. The resulting shape, if we assume <code>event_shape</code> and <code>batch_shape</code> are tuples is given by:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">shape</span> = event_shape + batch_shape
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">mu</span> = np.r_[1, 2]
<span style="font-weight: bold; font-style: italic;">sigma</span> = np.array([[.5, .5], [.4, .6]])
<span style="font-weight: bold; font-style: italic;">a_rv</span> = srng.multivariate_normal(mu, sigma, size=(2, 5))
<span style="font-weight: bold;">print</span>(a_rv.<span style="font-weight: bold;">eval</span>().shape)
</pre>
</div>

<p>
See <a target='_blank' rel='noopener noreferrer' class='external' href="https://ericmjl.github.io/blog/2019/5/29/reasoning-about-shapes-and-probability-distributions/">Eric Ma's blog post on the topic</a>.
</p>
</div>
</div>

<div id="outline-container-org9307569" class="outline-2">
<h2 id="org9307569">Problems with <code>RandomStream</code></h2>
<div class="outline-text-2" id="text-org9307569">
<p>
<a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aesara/pull/1211#discussion_r985057882">https://github.com/aesara-devs/aesara/pull/1211#discussion_r985057882</a>
</p>
</div>
</div>

<div id="outline-container-orgca70d43" class="outline-2">
<h2 id="orgca70d43">Proposal</h2>
<div class="outline-text-2" id="text-orgca70d43">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">rng</span> = at.random.RandomState()

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">RandomVariables divide the rng</span>
<span style="font-weight: bold; font-style: italic;">a_rv</span>, <span style="font-weight: bold; font-style: italic;">rng</span> = at.random.normal(rng, 0, 1)
<span style="font-weight: bold; font-style: italic;">b_rv</span>, <span style="font-weight: bold; font-style: italic;">_</span> = at.random.normal(rng, 0, 1)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">We have to update the rng manually</span>
<span style="font-weight: bold; font-style: italic;">a_rv</span> = at.random.normal(rng, 0, 1)
<span style="font-weight: bold; font-style: italic;">rng</span> = at.random.update(rng)
<span style="font-weight: bold; font-style: italic;">b_rv</span> = at.random.normal(rng, 0, 1)

<span style="font-weight: bold; font-style: italic;">rng_a</span>, <span style="font-weight: bold; font-style: italic;">rng_b</span> = at.random.split(rng)
<span style="font-weight: bold; font-style: italic;">a_rv</span> = at.random.normal(rng_a, 0, 1)
<span style="font-weight: bold; font-style: italic;">b_rv</span> = at.random.normal(rng_b, 0, 1)

<span style="font-weight: bold; font-style: italic;">rngs</span> = at.random.split(rng, 10)
<span style="font-weight: bold; font-style: italic;">rvs</span> = []
<span style="font-weight: bold;">for</span> rng <span style="font-weight: bold;">in</span> rngs:
    rvs.append(at.random.normal(rng, 0, 1))
</pre>
</div>

<p>
How does that solve the previous issues?
</p>

<ol class="org-ol">
<li>Monkey patching to specialize the RV <code>Op</code>\s</li>
<li>RVs in S-expressions and rewrites</li>
</ol>

<p>
What does that complicate?
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">standard_normal</span>():

</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4ee65f" class="outline-2">
<h2 id="orgb4ee65f">Links to this note</h2>
<div class="outline-text-2" id="text-orgb4ee65f">
<ul class="org-ul">
<li><a href="./20220729163627-aesara.html">Aesara</a></li>
<li><a href="./inbox.html">Writing inbox</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
